000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID. SPSTATE.                                             00020000
000300                                                                  00030000
000400 ENVIRONMENT DIVISION.                                            00040000
000500 CONFIGURATION SECTION.                                           00050000
000600 SPECIAL-NAMES.                                                   00060000
000700     DECIMAL-POINT IS COMMA.                                      00070000
000800          
001800 DATA DIVISION.                                                   00190000
002000 
002400                                                                  00240000
002500 WORKING-STORAGE SECTION.                                         00250000
002600 
        
003810
       LINKAGE SECTION.
        77 LS-STATE-FULL-NAME     PIC X(20).
        77 LS-STATE-CODE          PIC XX.

003900 PROCEDURE DIVISION USING LS-STATE-CODE
                                LS-STATE-FULL-NAME.

           
           EVALUATE TRUE
              WHEN LS-STATE-CODE = 'AL'
                  MOVE 'ALABAMA'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'AK'
                  MOVE 'ALASKA'               TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'AZ'
                  MOVE 'ARIZONA'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'AR'
                  MOVE 'ARKANSAS'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'CA'
                  MOVE 'CALIFORNIE'           TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NC'
                  MOVE 'CAROLINE DU NORD'     TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'SC'
                  MOVE 'CAROLINE DU SUD'      TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'CO'
                  MOVE 'COLORADO'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'CT'
                  MOVE 'CONNECTICUT'          TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'ND'
                  MOVE 'DAKOTA DU NORD'       TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'SD'
                  MOVE 'DAKOTA DU SUD'        TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'DE'
                  MOVE 'DELAWARE'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'FL'
                  MOVE 'FLORIDE'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'GA'
                  MOVE 'GEORGIE'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'HI'
                  MOVE 'HAWAI'                TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'ID'
                  MOVE 'IDAHO'                TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'IL'
                  MOVE 'ILLINOIS'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'IN'
                  MOVE 'INDIANA'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'IA'
                  MOVE 'IOWA'                 TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'KS'
                  MOVE 'KANSAS'               TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'KY'
                  MOVE 'KENTUCKY'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'LA'
                  MOVE 'LOUISIANE'            TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'ME'
                  MOVE 'MAINE'                TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MD'
                  MOVE 'MARYLAND'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MA'
                  MOVE 'MASSACHUSETTS'        TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MI'
                  MOVE 'MICHIGAN'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MN'
                  MOVE 'MINNESOTA'            TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MS'
                  MOVE 'MISSISSIPI'           TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MO'
                  MOVE 'MISSOURI'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'MT'
                  MOVE 'MONTANA'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NE'
                  MOVE 'NEBRASKA'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NV'
                  MOVE 'NEVADA'               TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NH'
                  MOVE 'NEW HAMPSHIRE'        TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NJ'
                  MOVE 'NEW JERSEY'           TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NY'
                  MOVE 'NEW YORK'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'NM'
                  MOVE 'NOUVEAU-MEXIQUE'      TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'OH'
                  MOVE 'OHIO'                 TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'OK'
                  MOVE 'OKLAHOMA'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'OR'
                  MOVE 'OREGON'               TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'PA'
                  MOVE 'PENNSYLVANIE'         TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'RI'
                  MOVE 'RHODE ISLAND'         TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'TN'
                  MOVE 'TENNESSEE'            TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'TX'
                  MOVE 'TEXAS'                TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'UT'
                  MOVE 'UTAH'                 TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'VT'
                  MOVE 'VERMONT'              TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'VA'
                  MOVE 'VIRGINIE'             TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'WV'
                  MOVE 'VIRGINIE-OCCIDENTALE' TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'WA'
                  MOVE 'WASHINGTON'           TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'WI'
                  MOVE 'WISCONSIN'            TO LS-STATE-FULL-NAME
              WHEN LS-STATE-CODE = 'WY'
                  MOVE 'WYOMING'              TO LS-STATE-FULL-NAME

005600     GOBACK.

      