000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONVERT.
000500 ENVIRONMENT DIVISION.
001510 DATA DIVISION.
001600 WORKING-STORAGE SECTION.
001700 77 WS-PRICE       PIC 9(3)V99.
001800 77 WS-RATE        PIC 9V9999 VALUE 0.
001900 77 ED-PRICE       PIC ZZ9.99.
003805
003806 LINKAGE SECTION.
003807 77 LS-DEVISE      PIC X(2).
003808 77 LS-PRICE-TEXT  PIC X(10).
003809 77 LS-PRICE-USD   PIC 9(3)V99 COMP-3.
003811
003812 PROCEDURE DIVISION USING LS-DEVISE LS-PRICE-TEXT LS-PRICE-USD.
003813
003815     DISPLAY 'DEVISE : ' LS-DEVISE
003816     DISPLAY 'PRIX DEVISE ACTUEL : ' LS-PRICE-TEXT
003817
003818     COMPUTE WS-PRICE = FUNCTION NUMVAL-C(LS-PRICE-TEXT)
003830     EVALUATE LS-DEVISE
003900     WHEN 'EU'
004000         COMPUTE LS-PRICE-USD = WS-PRICE * 1.06
004100     WHEN 'DO'
004200         COMPUTE LS-PRICE-USD = WS-PRICE
004310     WHEN 'YU'
004320         COMPUTE LS-PRICE-USD = WS-PRICE * 0.14
004330     WHEN OTHER
004400         DISPLAY 'DEVISE NON REPERTORIEE '
004410         MOVE 0 TO WS-RATE
004500     END-EVALUATE.
004600
004610     MOVE LS-PRICE-USD TO ED-PRICE
004700     DISPLAY 'PRIX CONVERTIE EN DOLLAR : ' ED-PRICE
004800     GOBACK.
