000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. P5PARTS.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900 DATA DIVISION.
001000
001100 WORKING-STORAGE SECTION.
001200
001300 77 LIB             PIC X(12) VALUE 'TEST P2 DATE'.
001400 77 RESULT          PIC X(10) VALUE ALL SPACE.
001500 77 EXPECTED-RESULT PIC X(10).
001600
001700 01 WS-INPUT.
001800     05 WS-DAY      PIC XX.
001900     05 FILLER      PIC X.
002000     05 WS-MONTH    PIC XX.
002100     05 FILLER      PIC X.
002200     05 WS-YEAR     PIC X(4).
002300
002400 01 TEST-CONTEXT.
002500     02 TEST-RUN   PIC 99 VALUE ZERO.
002600     02 PASSES     PIC 99 VALUE ZERO.
002700     02 FAILURES   PIC 99 VALUE ZERO.
002800
002900********************************************
003000 PROCEDURE DIVISION.
003100
003200     MOVE '01-01-2020' TO WS-INPUT
003300     MOVE '2020-01-01' TO EXPECTED-RESULT
003400
003500     CALL 'P2DDATE' USING BY CONTENT WS-INPUT
003600                          BY REFERENCE RESULT
003700     CALL 'ASSEQP2' USING TEST-CONTEXT, LIB, EXPECTED-RESULT,
003800                            RESULT
003900     DISPLAY 'RESULT: ' RESULT ' EXPECTED: ' EXPECTED-RESULT
004000
004100     MOVE '31-12-2020' TO WS-INPUT
004200     MOVE '2020-12-31' TO EXPECTED-RESULT
004300
004400     CALL 'P2DDATE' USING BY CONTENT WS-INPUT
004500                          BY REFERENCE RESULT
004600     CALL 'ASSEQP2' USING TEST-CONTEXT, LIB, EXPECTED-RESULT,
004700                            RESULT
004800     DISPLAY 'RESULT: ' RESULT ' EXPECTED: ' EXPECTED-RESULT
004900
005000     MOVE '30-11-2020' TO WS-INPUT
005100     MOVE '2020-11-30' TO EXPECTED-RESULT
005200
005300     CALL 'P2DDATE' USING BY CONTENT WS-INPUT
005400                          BY REFERENCE RESULT
005500     CALL 'ASSEQP2' USING TEST-CONTEXT, LIB, EXPECTED-RESULT,
005600                            RESULT
005700     DISPLAY 'RESULT: ' RESULT ' EXPECTED: ' EXPECTED-RESULT
005800
005900     DISPLAY '******* ' LIB ' ********'
006000     DISPLAY 'RUN ' TEST-RUN ' OK ' PASSES ' KO ' FAILURES
006100
006200     GOBACK.
