//JETCONV  JOB (ACCT#),'FABRICE',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,30)
//***************************************************
//*  ETAPE D'EXECUTION : EXECUTION DU PROGRAMME SOMTEST
//***************************************************
//EETCONV  EXEC PGM=TCONV
//STEPLIB  DD DSN=API5.COBOL.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*FICTTT   DD DSN=API5.AJC.TEX03.DATA,DISP=SHR
