//JEXEC45  JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,TIME=(0,20)
//*
//         SET SYSUID=API5
//*
//* EXECUTION DE PART4
//RUNPART4 EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FICXML   DD DSN=API5.AJC.BESTPROD.XML,DISP=SHR
//SYSTSIN  DD *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(PART4) PLAN (PART4)
/*
//*
//* EXECUTION DE P5PARTS
//RUNPART5 EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//EXT      DD DSN=API5.AJC.EXTRACT.DATA,DISP=SHR
//QTYTAB   DD DSN=API5.AJC.P5TAB.DATA,DISP=SHR
//SYSTSIN  DD *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(P5PARTS) PLAN (P5PARTS)
/*

























