//JEXEC123 JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,TIME=(0,20)
//*
//PROCLIB  JCLLIB ORDER=SDJ.FORM.PROCLIB
//*
//         SET SYSUID=API5
//*
//* EXECUTION DE PART1
//RUNPART1 EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//         DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//NEWPRODS DD DSN=API5.PROJET.NEWPRODS.DATA,DISP=SHR
//SYSTSIN  DD *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(PART1) PLAN (PART1)
/*
//SYSIN    DD *
10
/*
//*
//* EXECUTION DE PART2
//RUNPART2 EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//         DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FICVAS   DD DSN=API5.AJC.VENTESAS.DATA,DISP=SHR
//FICVEU   DD DSN=API5.AJC.VENTESEU.DATA,DISP=SHR
//SYSTSIN  DD *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(PART2) PLAN (PART2)
/*
//*
//* EXECUTION DE P3EXTRAC
//RUNP3EXT EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//EXT      DD DSN=API5.AJC.EXTRACT.DATA,DISP=SHR
//SYSTSIN  DD *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(P3EXTRAC) PLAN (P3EXTRAC)
/*
//*
//* EXECUTION DE P3FACTUR
//RUNP3FAC EXEC PGM=P3FACTUR
//STEPLIB  DD DSN=API5.COBOL.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
100
/*
//EXT      DD DSN=API5.AJC.EXTRACT.DATA,DISP=SHR
//FAC      DD DSN=API5.AJC.FACTURE.DATA,DISP=SHR
//STATE    DD DSN=API5.AJC.STATE.KSDS,DISP=SHR

