//JP2TEST  JOB (ACCT#),'FLORIAN',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,COND=(4,LT),
//     TIME=(0,10)
//*
//*  ETAPE DE COMPILATION
//*
//COMPIL   EXEC IGYWCL,PARM.COBOL=(ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=API5.SOURCE.COBOL(P2TEST),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//*            DD DSN=API5.SOURCE.DB2,DISP=SHR
//*
//*  ETAPE DE LINKEDIT
//*
//LKED.SYSLIB  DD DSN=API5.COBOL.LOAD,DISP=SHR
//LKED.SYSLMOD DD DSN=API5.COBOL.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN DD *
 INCLUDE SYSLIB('ASSEQP2')
 INCLUDE SYSLIB('P2DDATE')
 NAME P2TEST(R)
/*
//***************************************************
//*  ETAPE D'EXECUTION : EXECUTION DU PROGRAMME P2TEST
//***************************************************
//JEXO03S1 EXEC PGM=P2TEST
//STEPLIB  DD DSN=API5.COBOL.LOAD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
