//JSTATEKS JOB (ACCT#),'FLORIAN',MSGCLASS=H,REGION=4M,
//    CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//     TIME=(0,10)
//**************************
//*    DELETE KSDS
//DELKSDS  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE API5.AJC.STATE.KSDS
/*
//*
//*  ETAPE DE CREATION DU KSDS
//*
//CRESTATE EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER (NAME(API5.AJC.STATE.KSDS)-
                 VOLUME(APIWK2)            -
                 TRACKS(50 1)               -
                 FREESPACE(20 20)          -
                 KEYS(2 0)                 -
                 RECORDSIZE(80 80)         -
                 INDEXED)                  -
          DATA   (NAME(API5.AJC.STATE.KSDS.D))-
          INDEX  (NAME(API5.AJC.STATE.KSDS.I))
/*
//ADDDATA  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//DDOUT    DD DSN=API5.AJC.STATE.KSDS,DISP=SHR
//SYSIN    DD *
 REPRO INFILE(INPUT) OUTDATASET(API5.AJC.STATE.KSDS)
 PRINT INDATASET(API5.AJC.STATE.KSDS) CHAR
/*
//INPUT    DD *
AKALASKA
ALALABAMA
ARARKANSAS
AZARIZONA
CACALIFORNIE
COCOLORADO
CTCONNECTICUT
DEDELAWARE
FLFLORIDE
GAGEORGIE
HIHAWAI
IAIOWA
IDIDAHO
ILILLINOIS
ININDIANA
KSKANSAS
KYKENTUCKY
LALOUISIANE
MAMASSACHUSETTS
MDMARYLAND
MEMAINE
MIMICHIGAN
MNMINNESOTA
MOMISSOURI
MSMISSISSIPI
MTMONTANA
NCCAROLINE DU NORD
NDDAKOTA DU NORD
NENEBRASKA
NHNEW HAMPSHIRE
NJNEW JERSEY
NMNOUVEAU-MEXIQUE
NVNEVADA
NYNEW YORK
OHOHIO
OKOKLAHOMA
OROREGON
PAPENNSYLVANIE
RIRHODE ISLAND
SCCAROLINE DU SUD
SDDAKOTA DU SUD
TNTENNESSEE
TXTEXAS
UTUTAH
VAVIRGINIE
VTVERMONT
WAWASHINGTON
WIWISCONSIN
WVVIRGINIE-OCCIDENTALE
WYWYOMING
/*
